{
  "section": 1,
  "title": "QCI, Final Inspection, and Desk Audit Logic",
  "last_updated": "2025-07-09",
  "qci_certification_requirements": [
    "Final inspection must be completed by a QCI-Certified Final Inspector for all DOE-funded units.",
    "Final Inspector must have Energy Auditor (EA) certification as a prerequisite.",
    "QC Inspectors must be competent in diagnostic testing, file review, post-work inspections, and close-out.",
    "Temporary waivers for non-QCI staff require strict mentorship and OCA approval; renew annually.",
    "Independent final inspection is required (assessor cannot final inspect same job, unless approved by OCA with annual waiver)."
  ],
  "qci_mentorship_approach": [
    "Mentees may perform final inspections under direct QCI mentorship with signed review and attestation.",
    "A mentorship waiver must be submitted with timeline, unit count, and assigned mentor.",
    "OCA will randomly monitor mentee-inspected units for compliance."
  ],
  "final_inspection_process": [
    "Review audit, work scope, change orders, and ensure approved changes are documented.",
    "Collect photographs of completed work and required forms.",
    "Verify field measurements, maps/diagrams, and materials installed.",
    "Verify installation standards, work quality, and compliance with IHWAP standards.",
    "Conduct blower door test, when applicable and safe.",
    "Conduct health and safety tests and mitigation verification.",
    "Conduct steady-state efficiency test, if necessary.",
    "Obtain client signatures and provide written notification of any unsafe conditions.",
    "Upload Contractor Assurance & Guarantee form and Client Final Inspection Signature form.",
    "Complete client satisfaction questionnaire in IWx system after job is 'Done'."
  ],
  "final_inspection_timing_and_objectivity": [
    "Final inspection must be completed within 15 calendar days of work completion, unless OCA waiver granted.",
    "All required contractor documentation, invoices, and paperwork must be received before inspection.",
    "Inspector must re-measure dwelling and verify all work and materials.",
    "Inspector cannot be the same as assessor or work performer (unless with OCA-approved annual waiver).",
    "Final inspection must be objective and thorough, ensuring conformity to policy and standards."
  ],
  "callbacks_and_change_orders": [
    "Call-back measures and/or change orders from final inspection must be completed within 15 days, or delays documented.",
    "State Monitoring call-backs must be completed within 30 days (60-day goal for resolution)."
  ],
  "in_progress_inspections": [
    "Agencies must perform in-progress inspections on 20% of IHWAP units.",
    "In-progress inspection covers OSHA/worker safety, EPA/Lead Renovator standards, and IHWAP Field Standards.",
    "All findings must be documented in the IWx system and provide feedback/training to contractors as needed."
  ],
  "desk_audit_and_self_review": [
    "Minimum of 10 desk audits must be approved by State Tech before agency gains self-review status.",
    "Desk audit includes completed form, footprint, and Manual J (if HVAC involved), submitted to OCA.",
    "Desk audits must confirm scope, historic preservation, lead safe work, required documents, and photo documentation.",
    "After self-review status is achieved, State Techs perform random desk audits throughout the year."
  ],
  "data_entry_and_closeout": [
    "Agencies must close jobs in IWx system within 15 days of final inspection 'complete' status.",
    "Final costs must be entered into Scope of Work in IWx within 15 days."
  ],
  "photo_documentation": [
    "Color digital photos are required for all inspection failures and deficiencies.",
    "Photos must accompany callback/rework notices and post-correction verification.",
    "Photo documentation is required to support final inspection and audit trail."
  ],
  "client_and_contractor_forms": [
    "Contractor Assurance & Guarantee of Work (retain copy in file).",
    "Client Final Inspection Signature form.",
    "Client Satisfaction Questionnaire (completed in IWx)."
  ],
  "miscellaneous": [
    "Unlocking closed jobs in IWx requires formal change request, OCA approval, and documentation."
  ]
}
